# Problem Statement

1. Load the MallCustomer dataset in dataframe object df
2. Display summary statistics (mean, median, minimum, maximum, standard deviation) for
a dataset for each column
3. Display Measures of Dispersion ( Mean Absolute Deviation, Variance, Standard Deviation,
Range, Quartiles, Skewness)
4. if your categorical variable is age groupsa nd quantitative variable is income, then
provide summary statistics (minimum and maximum) of income grouped by the age
groups.

# Importing Libraries

In [1]:
import numpy as np
import pandas as pd

C:\Users\OM\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

# Importing the dataset

In [3]:
df=pd.read_csv(r"C:\Users\OM\Downloads\Mall_Customers.csv")

# Data Preprocessing

In [4]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [6]:
df.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [7]:
df.shape

(200, 5)

In [8]:
df.columns

Index(['CustomerID', 'Genre', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [9]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [10]:
df.isnull()

     CustomerID  Genre    Age  Annual Income (k$)  Spending Score (1-100)
0         False  False  False               False                   False
1         False  False  False               False                   False
2         False  False  False               False                   False
3         False  False  False               False                   False
4         False  False  False               False                   False
..          ...    ...    ...                 ...                     ...
195       False  False  False               False                   False
196       False  False  False               False                   False
197       False  False  False               False                   False
198       False  False  False               False                   False
199       False  False  False               False                   False

[200 rows x 5 columns]

In [11]:
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [13]:
df.dtypes

CustomerID                 int64
Genre                     object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [14]:
# Group by 'genre' and calculate summary statistics for numeric variables
summary_stats = df.groupby('Genre').describe()

# Extract relevant statistics (mean, median, min, max, std) for each numeric variable
numeric_stats = summary_stats[['Age', 'Annual Income (k$)', 'Spending Score (1-100)']].reset_index()

# Display the summary statistics
print(numeric_stats)

    Genre    Age                                                       \
           count       mean        std   min    25%   50%   75%   max
0  Female  112.0  38.098214  12.644095  18.0  29.00  35.0  47.5  68.0
1    Male   88.0  39.806818  15.514812  18.0  27.75  37.0  50.5  70.0

  Annual Income (k$)  ...               Spending Score (1-100)             \
               count  ...    75%    max                  count       mean
0              112.0  ...  77.25  126.0                  112.0  51.526786
1               88.0  ...  78.00  137.0                   88.0  48.511364


        std  min   25%   50%   75%   max
0  24.11495  5.0  35.0  50.0  73.0  99.0
1  27.89677  1.0  24.5  50.0  70.0  97.0

[2 rows x 25 columns]

# Mean

In [18]:
# Convert numeric columns to numeric data type
numeric_cols = ['Age', 'Annual Income (k$)', 'Spending Score (1-100)']
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric, errors='coerce')

# Now, you can compute mean for each numeric column grouped by 'genre'
mean_stats = df.groupby('Genre')[numeric_cols].mean()

# Display the mean statistics
print(mean_stats)

              Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female  38.098214           59.250000               51.526786
Male    39.806818           62.227273               48.511364

In [20]:
df[numeric_cols].mean()

Age                       38.85
Annual Income (k$)        60.56
Spending Score (1-100)    50.20
dtype: float64

In [22]:
df['Age'].mean()

38.85

In [24]:
df.loc[:,'Age'].mean()

38.85

In [27]:
mean_values = df[numeric_cols].iloc[0:4].mean(axis=1)
print(mean_values)

0    24.333333
1    39.000000
2    14.000000
3    38.666667
dtype: float64

# Median

In [28]:
# Convert numeric columns to numeric data type
numeric_cols = ['Age', 'Annual Income (k$)', 'Spending Score (1-100)']
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric, errors='coerce')

# Now, you can compute mean for each numeric column grouped by 'genre'
median_stats = df.groupby('Genre')[numeric_cols].median()

# Display the mean statistics
print(median_stats)

         Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female  35.0                60.0                    50.0
Male    37.0                62.5                    50.0

In [30]:
df[numeric_cols].median()

Age                       36.0
Annual Income (k$)        61.5
Spending Score (1-100)    50.0
dtype: float64

In [31]:
df['Age'].median()

36.0

In [32]:
df.loc[:,'Age'].median()

36.0

In [33]:
median_values = df[numeric_cols].iloc[0:4].median(axis=1)
print(median_values)

0    19.0
1    21.0
2    16.0
3    23.0
dtype: float64

# Mode

In [35]:
# Convert numeric columns to numeric data type
numeric_cols = ['Age', 'Annual Income (k$)', 'Spending Score (1-100)']
df[numeric_cols] = df[numeric_cols].apply(pd.to_numeric, errors='coerce')

# Now, you can compute mean for each numeric column grouped by 'genre'
mode_stats = df.groupby('Genre')[numeric_cols].agg(lambda x: x.mode().iloc[0])

# Display the mean statistics
print(mode_stats)

        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female   31                  78                      42
Male     19                  54                      46

In [37]:
df['Age'].mode()

0    32
Name: Age, dtype: int64

In [39]:
df.loc[:,'Age'].mode()

0    32
Name: Age, dtype: int64

In [40]:
mode_values = df[numeric_cols].iloc[0:4].mode(axis=1)
print(mode_values)

    0   1   2
0  15  19  39
1  15  21  81
2   6  16  20
3  16  23  77

# Standard Deviation

In [43]:
df[numeric_cols].std()

Age                       13.969007
Annual Income (k$)        26.264721
Spending Score (1-100)    25.823522
dtype: float64

In [44]:
df.loc[:,'Age'].std()

13.96900733155888

In [45]:
df['Age'].std()

13.96900733155888

In [46]:
std_values = df[numeric_cols].iloc[0:4].mode(axis=1)
print(std_values)

    0   1   2
0  15  19  39
1  15  21  81
2   6  16  20
3  16  23  77

# Min

In [47]:
df.min()

CustomerID                     1
Genre                     Female
Age                           18
Annual Income (k$)            15
Spending Score (1-100)         1
dtype: object

In [48]:
df.loc[:,'Age'].min(skipna=False)

18

In [49]:
df.loc[:,'Annual Income (k$)'].min(skipna=False)

15

# Max

In [50]:
df.max()

CustomerID                 200
Genre                     Male
Age                         70
Annual Income (k$)         137
Spending Score (1-100)      99
dtype: object

In [51]:
df.loc[:,'Annual Income (k$)'].max(skipna=False)

137

In [52]:
df.loc[:,'Age'].max(skipna=False)

70

In [56]:
df.rename(columns={'Annual Income (k$)':'Income'})
df.head()

   CustomerID   Genre  Age  Income  Spending Score (1-100)
0           1    Male   19      15                      39
1           2    Male   21      15                      81
2           3  Female   20      16                       6
3           4  Female   23      16                      77
4           5  Female   31      17                      40

In [57]:
df.head()

   CustomerID   Genre  Age  Income  Spending Score (1-100)
0           1    Male   19      15                      39
1           2    Male   21      15                      81
2           3  Female   20      16                       6
3           4  Female   23      16                      77
4           5  Female   31      17                      40

# Applying One hot encoding to column Genre

In [59]:
features_df=df.drop(columns=['Genre'])

In [60]:
from sklearn import preprocessing

In [61]:
one_enc = preprocessing.OneHotEncoder()

In [62]:
encoded_genre = one_enc.fit_transform(df[['Genre']])
enc_df = pd.DataFrame(encoded_genre.toarray())
print(enc_df.head())

     0    1
0  0.0  1.0
1  0.0  1.0
2  1.0  0.0
3  1.0  0.0
4  1.0  0.0

In [63]:
df_encode = features_df.join(enc_df)
df_encode

     CustomerID  Age  Income  Spending Score (1-100)    0    1
0             1   19      15                      39  0.0  1.0
1             2   21      15                      81  0.0  1.0
2             3   20      16                       6  1.0  0.0
3             4   23      16                      77  1.0  0.0
4             5   31      17                      40  1.0  0.0
..          ...  ...     ...                     ...  ...  ...
195         196   35     120                      79  1.0  0.0
196         197   45     126                      28  1.0  0.0
197         198   32     126                      74  0.0  1.0
198         199   32     137                      18  0.0  1.0
199         200   30     137                      83  0.0  1.0

[200 rows x 6 columns]

In [64]:
df_encode.rename(columns = {0:'Male',1:'Female'}, inplace = True)
df_encode

     CustomerID  Age  Income  Spending Score (1-100)  Male  Female
0             1   19      15                      39   0.0     1.0
1             2   21      15                      81   0.0     1.0
2             3   20      16                       6   1.0     0.0
3             4   23      16                      77   1.0     0.0
4             5   31      17                      40   1.0     0.0
..          ...  ...     ...                     ...   ...     ...
195         196   35     120                      79   1.0     0.0
196         197   45     126                      28   1.0     0.0
197         198   32     126                      74   0.0     1.0
198         199   32     137                      18   0.0     1.0
199         200   30     137                      83   0.0     1.0

[200 rows x 6 columns]

## Measures of dispersion

In [74]:
# Calculate measures of dispersion
#mean_abs_dev = df['Income'].mad()
variance = df['Income'].var()
std_dev = df['Income'].std()
range_income = df['Income'].max() - df['Income'].min()
quartiles = df['Income'].quantile([0.25, 0.5, 0.75])
skewness = df['Income'].skew()

# Display measures of dispersion
print("Measures of Dispersion:")
#print("Mean Absolute Deviation:", mean_abs_dev)
print("Variance:", variance)
print("Standard Deviation:", std_dev)
print("Range:", range_income)
print("Quartiles:")
print(quartiles)
print("Skewness:", skewness)

Measures of Dispersion:
Variance: 689.8355778894472
Standard Deviation: 26.264721165271244
Range: 122
Quartiles:
0.25    41.5
0.50    61.5
0.75    78.0
Name: Income, dtype: float64
Skewness: 0.3218425498619055

In [85]:
df.mad()
mad_values = df.apply(lambda x: x.mad(), axis=0)

AttributeError: 'DataFrame' object has no attribute 'mad'

# summary statistics of income grouped by age groups

In [76]:
# Group by age groups and calculate summary statistics of income
age_groups_income_summary = df.groupby('Age')['Income'].agg(['min', 'max'])

# Display summary statistics of income grouped by age groups
print("\nSummary Statistics of Income Grouped by Age Groups:")
print(age_groups_income_summary)

Summary Statistics of Income Grouped by Age Groups:
     min  max
Age
18    33   65
19    15   81
20    16   73
21    15   62
22    17   57
23    16   70
24    20   60
25    24   77
26    54   62
27    40   88
28    76  101
29    28   98
30    19  137
31    17   81
32    48  137
33    42  113
34    58  103
35    18  120
36    37  103
37    20   97
38    54  113
39    69   78
40    29   87
41    99  103
42    34   86
43    48   78
44    73   78
45    28  126
46    25   98
47    43  120
48    39   77
49    33   65
50    40   85
51    44   67
52    23   88
53    33   46
54    28  101
55    57   57
56    79   79
57    54   75
58    20   88
59    43   93
60    30   50
63    48   65
64    19   19
65    38   63
66    63   63
67    19   62
68    48   63
69    44   44
70    46   49

In [77]:
income_summary = df.groupby('Age')['Income'].describe()

In [78]:
income_summary

     count        mean        std   min     25%    50%     75%    max
Age
18     4.0   51.250000  14.056434  33.0   44.25   53.5   60.50   65.0
19     8.0   57.000000  20.632845  15.0   47.50   63.5   67.25   81.0
20     5.0   41.600000  24.815318  16.0   21.00   37.0   61.00   73.0
21     5.0   38.800000  19.018412  15.0   30.00   33.0   54.00   62.0
22     3.0   31.333333  22.278540  17.0   18.50   20.0   38.50   57.0
23     6.0   41.500000  23.441416  16.0   20.75   41.5   60.00   70.0
24     4.0   39.250000  16.357975  20.0   33.50   38.5   44.25   60.0
25     3.0   57.666667  29.263174  24.0   48.00   72.0   74.50   77.0
26     2.0   58.000000   5.656854  54.0   56.00   58.0   60.00   62.0
27     6.0   63.166667  18.400181  40.0   49.50   63.5   75.25   88.0
28     4.0   85.250000  11.615363  76.0   76.75   82.0   90.50  101.0
29     5.0   63.600000  28.866936  28.0   40.00   73.0   79.00   98.0
30     7.0   76.142857  39.612408  19.0   56.00   78.0   93.50  137.0
31     8.0   48.375000  23.323425  17.0   35.50   41.5   70.50   81.0
32    11.0   87.181818  26.809768  48.0   74.00   77.0  100.00  137.0
33     3.0   80.333333  35.837597  42.0   64.00   86.0   99.50  113.0
34     5.0   79.000000  15.968719  58.0   78.00   78.0   78.00  103.0
35     9.0   46.666667  38.632888  18.0   21.00   24.0   74.00  120.0
36     6.0   81.000000  22.556595  37.0   85.50   87.0   87.00  103.0
37     3.0   65.000000  40.112342  20.0   49.00   78.0   87.50   97.0
38     6.0   74.500000  20.462160  54.0   64.75   69.0   76.25  113.0
39     3.0   72.666667   4.725816  69.0   70.00   71.0   74.50   78.0
40     6.0   61.666667  19.551641  29.0   55.50   64.5   70.50   87.0
41     2.0  101.000000   2.828427  99.0  100.00  101.0  102.00  103.0
42     2.0   60.000000  36.769553  34.0   47.00   60.0   73.00   86.0
43     3.0   65.666667  15.695010  48.0   59.50   71.0   74.50   78.0
44     2.0   75.500000   3.535534  73.0   74.25   75.5   76.75   78.0
45     3.0   69.333333  50.767444  28.0   41.00   54.0   90.00  126.0
46     3.0   59.000000  36.755952  25.0   39.50   54.0   76.00   98.0
47     6.0   70.166667  27.694163  43.0   51.75   65.5   76.25  120.0
48     5.0   58.200000  13.700365  39.0   54.00   60.0   61.00   77.0
49     7.0   51.000000  12.884099  33.0   40.50   54.0   62.00   65.0
50     5.0   58.600000  18.420098  40.0   43.00   58.0   67.00   85.0
51     2.0   55.500000  16.263456  44.0   49.75   55.5   61.25   67.0
52     2.0   55.500000  45.961941  23.0   39.25   55.5   71.75   88.0
53     2.0   39.500000   9.192388  33.0   36.25   39.5   42.75   46.0
54     4.0   59.750000  30.998656  28.0   42.25   55.0   72.50  101.0
55     1.0   57.000000        NaN  57.0   57.00   57.0   57.00   57.0
56     1.0   79.000000        NaN  79.0   79.00   79.0   79.00   79.0
57     2.0   64.500000  14.849242  54.0   59.25   64.5   69.75   75.0
58     2.0   54.000000  48.083261  20.0   37.00   54.0   71.00   88.0
59     4.0   65.250000  21.792583  43.0   51.25   62.5   76.50   93.0
60     3.0   43.333333  11.547005  30.0   40.00   50.0   50.00   50.0
63     2.0   56.500000  12.020815  48.0   52.25   56.5   60.75   65.0
64     1.0   19.000000        NaN  19.0   19.00   19.0   19.00   19.0
65     2.0   50.500000  17.677670  38.0   44.25   50.5   56.75   63.0
66     2.0   63.000000   0.000000  63.0   63.00   63.0   63.00   63.0
67     4.0   45.500000  18.699376  19.0   40.00   50.5   56.00   62.0
68     3.0   56.666667   7.767453  48.0   53.50   59.0   61.00   63.0
69     1.0   44.000000        NaN  44.0   44.00   44.0   44.00   44.0
70     2.0   47.500000   2.121320  46.0   46.75   47.5   48.25   49.0